OpenFOAM/reducedSolution/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// pythonGenerated start 

p0x   0;
p1x   1e-3;
p0y   -1e-4;
p1y    1e-4;
p0z   -1e-4;
p1z    1e-4;

// pythonGenerated stop

resx   3000;

vertices
(
    ( $p0x   $p0y   $p0z   )   //0
    ( $p1x   $p0y   $p0z   )   //1
    ( $p1x   $p1y   $p0z   )   //2
    ( $p0x   $p1y   $p0z   )   //3

    ( $p0x   $p0y   $p1z   )   //4
    ( $p1x   $p0y   $p1z   )   //5
    ( $p1x   $p1y   $p1z   )   //6
    ( $p0x   $p1y   $p1z   )   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   ($resx 1 1) 
    simpleGrading 
    (
      1
      1
      1
    )
);


edges
(
);

boundary
(
    inside
    {
        type patch;
        faces
        (
            (3 0 4 7)
        );
    }
    outside
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sides 
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
